# Employee Data Cleaning Notebook
**Goal**: Transform messy, dirty data into a clean, analysis-ready dataset

File: `employee_data_with_quality_issues.xlsx`

Common issues visible in the data:
- Inconsistent name casing & duplicates
- Invalid ages (text, extreme values)
- Negative / missing / invalid salaries
- Multiple date formats + invalid dates
- Inconsistent department names
- Missing values in different formats (NaN, empty, "not available")
- Trailing/leading spaces, typos

In [4]:
# Import the required files────
import pandas as pd
import numpy as np
from datetime import datetime
import re

In [9]:
#  Load the file & Expolatory Analysis 

df = pd.read_excel("employee_data_with_quality_issues.xlsx")

print("Shape:", df.shape)
display(df.head(3))
display(df.tail(3))
display(df.size)

Shape: (20, 5)

        Name      Age Salary   Join Date Department
0    John Doe      29  55000  15-01-2020      Sales
1    john doe      29  55000  2020-01-15      sales
2  Jane Smith  thirty  62000  2019/03/22  Marketing

        Name   Age Salary   Join Date Department
17     Olivia   26  52000  2019-04-31    Finance
18       Mark  NaN  47000  2018-05-20         IT
19  JOHN  DOE   29  55000  2020-01-15     Sales

100

In [19]:
#  Check the statisctis of data
df.describe()
df.info()
df.isnull()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        19 non-null     object
 1   Age         16 non-null     object
 2   Salary      19 non-null     object
 3   Join Date   20 non-null     object
 4   Department  20 non-null     object
dtypes: object(5)
memory usage: 932.0+ bytes

    Name     Age  Salary  Join Date  Department
0   False  False   False      False       False
1   False  False   False      False       False
2   False  False   False      False       False
3   False   True   False      False       False
4   False  False   False      False       False
5   False  False   False      False       False
6   False  False   False      False       False
7   False   True   False      False       False
8   False  False   False      False       False
9   False   True   False      False       False
10  False  False   False      False       False
11  False  False    True      False       False
12  False  False   False      False       False
13  False  False   False      False       False
14  False  False   False      False       False
15  False  False   False      False       False
16   True  False   False      False       False
17  False  False   False      False       False
18  False   True   False      False       False
19  False  False   False      False       False

In [11]:
# Drop any missing value and save it in new df
df_clean = df.dropna().copy()
df_clean

           Name      Age         Salary   Join Date Department
0       John Doe      29          55000  15-01-2020      Sales
1       john doe      29          55000  2020-01-15      sales
2     Jane Smith  thirty          62000  2019/03/22  Marketing
4      Ana-Marie      41  not available  2017-11-05         HR
5        Chris P      22          39000  2021-02-30         IT
6         Sara K     135          72000  2016-05-18    Finance
8         Li Wei      27          51000  2018-04-09  marketing
10  James O'Neil      44          82000  2014/06/12         HR
12     Robert Jr      17          30000  2022-01-01      Sales
13         Karen     200          70000  2010-10-10         HR
14         Tommy      28            55k  2018-08-08         IT
15          Alex      33          59000  2017-02-29    Finance
17        Olivia      26          52000  2019-04-31    Finance
19     JOHN  DOE      29          55000  2020-01-15     Sales

In [12]:
# Standardize column names (lowercase, strip, underscore)
df_clean.columns = df_clean.columns.str.strip().str.lower().str.replace(" ", "_", regex=False)
df_clean.columns

Index(['name', 'age', 'salary', 'join_date', 'department'], dtype='object')

In [13]:
# Clean NAME & Department column
# Name
df_clean['name'] = df_clean['name'].astype(str).str.strip().str.title().str.replace(r'\s+', ' ', regex=True)

# Department
df_clean['department'] = (
    df_clean['department']
    .astype(str)
    .str.strip()
    .str.title()
    .replace({
        'Hr': 'HR', 'It': 'IT', 'Sale': 'Sales', 'Marketting': 'Marketing',
        'Fin': 'Finance', 'H.R.': 'HR', '': np.nan, 'nan': np.nan
    })
)
df_clean

            name     age         salary   join_date department
0       John Doe      29          55000  15-01-2020      Sales
1       John Doe      29          55000  2020-01-15      Sales
2     Jane Smith  thirty          62000  2019/03/22  Marketing
4      Ana-Marie      41  not available  2017-11-05         HR
5        Chris P      22          39000  2021-02-30         IT
6         Sara K     135          72000  2016-05-18    Finance
8         Li Wei      27          51000  2018-04-09  Marketing
10  James O'Neil      44          82000  2014/06/12         HR
12     Robert Jr      17          30000  2022-01-01      Sales
13         Karen     200          70000  2010-10-10         HR
14         Tommy      28            55k  2018-08-08         IT
15          Alex      33          59000  2017-02-29    Finance
17        Olivia      26          52000  2019-04-31    Finance
19      John Doe      29          55000  2020-01-15      Sales

In [14]:
# Clean Age Column 
age_map = {
    'thirty': 30,
    'NaN': np.nan,
    '': np.nan,
    'unknown': np.nan,
    'N/A': np.nan
}

df_clean['age'] = df_clean['age'].replace(age_map)
df_clean['age'] = pd.to_numeric(df_clean['age'], errors='coerce')
df_clean['age'] = df_clean['age'].where(
    (df_clean['age'] >= 16) & (df_clean['age'] <= 70),
    np.nan
)
df_clean

            name   age         salary   join_date department
0       John Doe  29.0          55000  15-01-2020      Sales
1       John Doe  29.0          55000  2020-01-15      Sales
2     Jane Smith  30.0          62000  2019/03/22  Marketing
4      Ana-Marie  41.0  not available  2017-11-05         HR
5        Chris P  22.0          39000  2021-02-30         IT
6         Sara K   NaN          72000  2016-05-18    Finance
8         Li Wei  27.0          51000  2018-04-09  Marketing
10  James O'Neil  44.0          82000  2014/06/12         HR
12     Robert Jr  17.0          30000  2022-01-01      Sales
13         Karen   NaN          70000  2010-10-10         HR
14         Tommy  28.0            55k  2018-08-08         IT
15          Alex  33.0          59000  2017-02-29    Finance
17        Olivia  26.0          52000  2019-04-31    Finance
19      John Doe  29.0          55000  2020-01-15      Sales

In [15]:
# Clean Salary Column 
# Remove currency symbols, 'k', 'not available', etc.
df_clean['salary'] = df_clean['salary'].replace({
    'not available': np.nan,
    'NaN': np.nan,
    '': np.nan,
    -48000: np.nan,           # negative salary doesn't make sense
})

df_clean['salary'] = df_clean['salary'].astype(str).str.replace('k', '000', regex=False)
df_clean['salary'] = df_clean['salary'].replace(r'[\$,]', '', regex=True)
df_clean['salary'] = pd.to_numeric(df_clean['salary'], errors='coerce')

df_clean

            name   age   salary   join_date department
0       John Doe  29.0  55000.0  15-01-2020      Sales
1       John Doe  29.0  55000.0  2020-01-15      Sales
2     Jane Smith  30.0  62000.0  2019/03/22  Marketing
4      Ana-Marie  41.0      NaN  2017-11-05         HR
5        Chris P  22.0  39000.0  2021-02-30         IT
6         Sara K   NaN  72000.0  2016-05-18    Finance
8         Li Wei  27.0  51000.0  2018-04-09  Marketing
10  James O'Neil  44.0  82000.0  2014/06/12         HR
12     Robert Jr  17.0  30000.0  2022-01-01      Sales
13         Karen   NaN  70000.0  2010-10-10         HR
14         Tommy  28.0  55000.0  2018-08-08         IT
15          Alex  33.0  59000.0  2017-02-29    Finance
17        Olivia  26.0  52000.0  2019-04-31    Finance
19      John Doe  29.0  55000.0  2020-01-15      Sales

In [16]:
# Clean the Dates Column 
import calendar

from datetime import datetime

def validate_date(date_str):
    # Normalize separators
    date_str = date_str.replace('/', '-')
    parts = date_str.split('-')

    # Detect format
    if len(parts[0]) == 4:
        # YYYY-MM-DD
        year, month, day = parts
    else:
        # DD-MM-YYYY
        day, month, year = parts

    # Try to validate
    try:
        dt = datetime(int(year), int(month), int(day))
        return dt.strftime('%Y-%m-%d')
    except:
        return np.nan

# Apply to DataFrame
df_clean['join_date'] = df_clean['join_date'].apply(validate_date)
df_clean

            name   age   salary   join_date department
0       John Doe  29.0  55000.0  2020-01-15      Sales
1       John Doe  29.0  55000.0  2020-01-15      Sales
2     Jane Smith  30.0  62000.0  2019-03-22  Marketing
4      Ana-Marie  41.0      NaN  2017-11-05         HR
5        Chris P  22.0  39000.0         NaN         IT
6         Sara K   NaN  72000.0  2016-05-18    Finance
8         Li Wei  27.0  51000.0  2018-04-09  Marketing
10  James O'Neil  44.0  82000.0  2014-06-12         HR
12     Robert Jr  17.0  30000.0  2022-01-01      Sales
13         Karen   NaN  70000.0  2010-10-10         HR
14         Tommy  28.0  55000.0  2018-08-08         IT
15          Alex  33.0  59000.0         NaN    Finance
17        Olivia  26.0  52000.0         NaN    Finance
19      John Doe  29.0  55000.0  2020-01-15      Sales

In [20]:
# Final Cleaning of all data 
df_clean = df_clean.replace("", pd.NA)
df_clean = df_clean.drop_duplicates().copy()
df_clean = df_clean.dropna().copy()

df_clean

            name   age   salary   join_date department
0       John Doe  29.0  55000.0  2020-01-15      Sales
2     Jane Smith  30.0  62000.0  2019-03-22  Marketing
8         Li Wei  27.0  51000.0  2018-04-09  Marketing
10  James O'Neil  44.0  82000.0  2014-06-12         HR
12     Robert Jr  17.0  30000.0  2022-01-01      Sales
14         Tommy  28.0  55000.0  2018-08-08         IT